[
    {
        "id": 8,
        "position": "Associate Cloud Engineer",
        "company": "PT Bithealth Teknologi Pintar",
        "years": "Oct 2024 - Now",
        "type": "Full-time",
        "typebg": 1,
        "start": 24101504,
        "tools": ["AWS", "Node JS","PostgresSQL", "MongoDB", "Elasticsearch", "Kubernetes", "Cloudflare", "OpenVPN", "Wiregurard", "Clonezilla", "Proxmox", "Linux", "Ubuntu", "Jenkins", "Prometheus", "Grafana", "RabbitMQ"],
        "filter": [1, 2, 3, 4, 13, 16],
        "skills": ["Cloud Engineering", "Network Engineering", "System Engineering", "Database Engineering", "DevOps Engineering", "Automation Engineering", "QA Engineering"],
        "tasks": [
            "Managed and supported a full stack of cloud and on-premise infrastructure, including AWS accounts, bare-metal servers, CI/CD pipelines, and database clusters, delivering scalable and secure solutions across environments.",
            "Deployed and maintained Kubernetes clusters on AWS EKS using eksctl or helm, automated node group creation using terraform, performed cluster upgrades, and optimized resources for cost and performance.",
            "Performed AWS account decomposition and closure to eliminate unused infrastructure and reduce operational risks",
            "Maintained AWS SES health by monitoring bounce rates and optimizing email delivery",
            "Standardized AWS naming conventions and resource tagging for better visibility and governance",
            "Strengthened AWS security by upgrading to current standards, rotating API keys, and implementing compliance patches across environments.",
            "Selected internally to pursue AWS Solutions Architect Associate certification and AWS AI training program",
            "Fully managed client CI/CD pipelines using Bitbucket, Jenkins, AWS ECR, and AWS EKS to ensure reliable deployments and agile workflows.",
            "Deployed and managed PostgreSQL HA clusters using Crunchy Postgres with Master-Slave replication, PgBouncer, and PgPool for load balancing and failover.",
            "Set up MongoDB HA using Percona, ensuring data redundancy and minimal downtime.",
            "Tuned and monitored database performance by analyzing slow and expensive queries using pg_stat_statements, Postgres Exporter, and MongoDB query profiling.",
            "Improved monitoring and observability by centralizing logs and dashboards in Grafana and integrating APM tools for better system visibility.",
            "Managed RabbitMQ Web virtual hosts and integrated them into cloud workflows.",
            "Maintained and supported client networks using AWS CloudFront, Cloudflare, APM tools, and VPN solutions including OpenVPN and Pritunl.",
            "Administered and supported bare metal infrastructure, including server upgrades, Proxmox/Ubuntu VM deployments, SSD/HDD backups with Clonezilla, and hospital hardware enhancements."
        ]
    },
    {
        "id": 9,
        "position": "Associate Software Engineer",
        "company": "PT Bithealth Teknologi Pintar",
        "years": "Nov 2023 - Oct 2024",
        "type": "Full-time",
        "typebg": 1,
        "start": 23112410,
        "tools": ["Node JS", "Express JS", "Javascript", "Typescript", "Vue JS", "HTML", "CSS", "Bootstrap", "Swagger", "Nest JS", "GraphQL", "PostgresSQL"],
        "filter": [5, 6],
        "skills": ["Backend Engineering", "Frontend Engineering", "QA Engineering"],
        "tasks": [
            "Participated in an intensive 6-month Full Stack Developer Bootcamp at Hacktiv8, gaining hands-on experience with HTML, CSS, JavaScript, Node.js, Express.js, GraphQL, Vue.js, PostgresSQL, and Bootstrap.",
            "Acted as Frontend Developer in the final bootcamp project, building a Doctor Appointment Website using Vue.js.",
            "Served as a Backend Engineer for nearly 1 year on a client project, utilizing Express.js to deliver backend solutions.",
            "Developed an Operational Dashboard Application that enables product teams to explore database insights without writing SQL queries, using Express.js and PostgresSQL.",
            "Enhanced and support the client's email delivery system by integrating and optimizing AWS SES via Express.js and PostgresSQL.",
            "Authored and maintained API documentation for 6 backend repositories using Swagger.js, ensuring clear communication and developer onboarding.",
            "Conducted research and provided insights on migrating the client's backend architecture to NestJS for future scalability and maintainability."
        ]
    },
    {
        "id": 10,
        "position": "Consumer Monitoring System for Detecting and Preventing the Return of Dirty Dishes Using Object Detection and IoT Technology",
        "company": "Ruang Elektro",
        "years": "Nov 2023 - Dec 2023",
        "type": "Freelance",
        "typebg": 3,
        "start": 23082312,
        "tools": ["Node JS", "Javascript", "HTML", "YOLOv3", "Firebase", "ESP32 Cam", "Antares"],
        "filter": [5, 11, 8, 10],
        "skills": ["Frontend Engineering", "IoT Engineering", "Computer Vision Engineering", "Embedded System Engineering"],
        "tasks": "Developed a consumer monitoring system to detect and prevent the return of dirty dishes using IoT and object detection technology. The system utilized an ESP32-CAM to capture images of the canteen area, which were sent to Firebase and processed by a YOLOv3 model on a separate server to detect unreturned dishes. Detection results were forwarded to the Antares IoT platform, and a real-time web dashboard built with vanilla HTML, CSS, and JavaScript to display monitoring data."
    },
    {
        "id": 11,
        "position": "Seatbelt Detection in Vehicles and Helmet Detection using YOLOv5, Faster RCNN, and RetinaNet Architecture",
        "company": "Ruang Elektro",
        "years": "Nov 2023 - Jan 2024",
        "type": "Freelance",
        "typebg": 3,
        "start": 23082401,
        "tools": ["YOLOv5", "Faster R-CNN", "RetinaNet", "Google Collab", "Python", "Roboflow"],
        "filter": [8],
        "skills": ["Computer Vision Engineering"],
        "tasks": "Developed advanced automotive safety detection systems using deep learning, focusing on seatbelt and helmet detection. Implemented YOLOv5, Faster R-CNN, and RetinaNet architectures to analyze annotated images and video inputs for real-time detection. Seatbelt detection models were trained and validated using images from Roboflow, while helmet detection used both images and video footage. Model performance was evaluated using confusion matrices to ensure accuracy and reliability in safety-critical scenarios."
    },
    {
        "id": 12,
        "position": "Production Engineer Intern",
        "company": "PT Panasonic Manufacturing Indonesia",
        "years": "Oct 2022 - Dec 2022",
        "type": "Internship",
        "typebg": 2,
        "start": 22102212,
        "tools": ["Excel", "Arduino"],
        "skills": ["Data Analyst", "Embedded System Engineering", "Manufacturing Engineeringing", "HSE"],
        "filter": [15, 10],
        "tasks": [
            "Monitored and supported real-time operations of the main production system on a high-volume refrigerator assembly line, ensuring minimal downtime and smooth workflow.",
            "Collected and analyzed production efficiency data, including assembly time metrics and failure rates; categorized root causes of line stoppages using Excel to provide actionable insights.",
            "Developed a conceptual improvement model for an internal communication system using Arduino and RS-485 protocol, aiming to enhance real-time coordination across assembly points."
        ]
    },
    {
        "id": 13,
        "position": "IoT Engineer Intern",
        "company": "PT Miota Internasional Teknologi",
        "years": "Jan 2022 - Apr 2022",
        "type": "Internship",
        "typebg": 2,
        "start": 22012204,
        "tools": ["STM32CubeIDE", "STM32F103C8T6/Blue Pill", "Multimeter", "Oscilloscope", "Solering Iron", "ACS712", "ESP32", "MX485", "OLED LCD"],
        "filter": [10, 9, 14],
        "skills": ["Embedded System Engineering", "Hardware Engineering", "Electronics Engineering"],
        "tasks": [
            "Designed and developed a custom IoT-based kWh metering device using the STM32F103C8T6 microcontroller, capable of measuring and calculating active, reactive, and apparent power in real time.",
            "Integrated multiple hardware components: ACS712 for current sensing, ZMPT101B for voltage sensing, OLED display for real-time readouts, RS-485 interface for industrial communication",
            "Programmed the entire embedded system using STM32CubeIDE with HAL (Hardware Abstraction Layer), ensuring stable and efficient data acquisition, signal processing, and communication.",
            "Conducted in-depth research on electrical power theory to implement accurate algorithms for power computation onboard the microcontroller."
        ]
    },
    {
        "id": 14,
        "position": "Patient Care: Management system application that will help users in arranging appointments with doctors.",
        "company": "PT Bithealth Teknologi Pintar and Hacktiv8",
        "years": "Mar 2024 - Jun 2024",
        "type": "Project",
        "typebg": 4,
        "start": 24032406,
        "tools": ["Vue JS", "HTML", "JSS", "Javascript"],
        "filter": [5],
        "skills": ["Frontend Engineering"],
        "tasks": "Single Page Application (SPA) website using Vue (set up with Vite) for a patient care management system that helps users schedule appointments with doctors. The application should include a login and register page for patient account management, with an optional Google OAuth integration for extra points. The homepage will display a list of available doctors, allowing users to view services, and includes shortcuts to a form page for scheduling appointments and an appointment history page. Features include a search bar with filtering and sorting options, and a logout button. A detail page for each doctor should provide information like name, specialty, practice address, schedule, phone number, and email, and allow authorized users to book new appointments. The new appointment page will display patient and doctor information, requiring user authorization to create an appointment. The history appointment page will list all appointments, enable users to create new ones, modify existing details, or cancel appointments, with filtering and sorting options. State management should be implemented with Pinia, and client-side errors should be displayed using SweetAlert or Toastify, avoiding window alerts. The application should ensure reactive page transitions without browser refreshes and can be deployed using services like Firebase, Netlify, or Vercel. Styling and usability are open for creativity."
    },
    {
        "id": 15,
        "position": "Internet of Things-Based Heat Therapy Device for Menstrual Pain",
        "company": "Ruang Elektro",
        "years": "May 2023 - Jul 2023",
        "type": "Freelance",
        "typebg": 3,
        "start": 23052307,
        "tools": ["ESP01", "BTS7960", "Arduino", "Nichrome Wire", "Blynk"],
        "filter": [11, 10],
        "skills": ["Embedded System Engineering", "IoT Engineering"],
        "tasks": "A project aimed at designing a heat therapy device specifically for the lower abdominal area involves creating a heating element using 0.404 mm Nichrome wire based on Ohm's Law to generate heat energy. The author employs an Arduino Uno R3 as the primary microcontroller, which is connected to an ESP-01 Wi-Fi module. Additionally, a BTS7960 motor driver is utilized to control the voltage supplied to the heating element, enabling adjustable heat output according to the voltage regulated by the motor driver. The resulting prototype, intended for dysmenorrhea treatment, features a 20-minute timer and allows the heat level to be adjusted from 0% to 100%, achieving an average temperature range from 28.21°C at 0% to 53.58°C at 100%."
    },
    {
        "id": 16,
        "position": "Design and develop an Internet of Things based water and air quality monitoring system using LPWAN network (NB-IOT and LoRaWAN)",
        "company": "Ruang Elektro",
        "years": "May 2023 - Jul 2023",
        "type": "Freelance",
        "typebg": 3,
        "start": 23052307,
        "tools": ["ESP32", "RFM95", "SIM7000E", "PH-4502C", "DS18B20", "PMS5003", "Tipping Bucket Rain Ombrometer", "YF-S201C", "Antares"],
        "filter": [10, 11, 12, 13],
        "skills": ["Embedded System Engineering", "IoT Engineering", "Wireless Engineering", "Network Engineering"],
        "tasks": "Designed and developed an IoT-based water and air quality monitoring system using LPWAN technologies (LoRaWAN and NB-IoT), consisting of four custom-built sensor devices that transmit real-time environmental data to the Antares platform. Device 1 monitors pH, temperature, and turbidity with LoRa (single-hop), Device 2 uses NB-IoT to track pH and temperature via cellular networks, Device 3 measures air quality (PM2.5, PM5, PM10) using LoRa (multi-hop), and Device 4 monitors water flow and rainfall with LoRa (single-hop). Each device sends structured data packets including sensor readings, RSSI, SNR, path loss, and delay for network analysis. Built using ESP32 microcontrollers, RFM95 (LoRa), and SIM7000E (NB-IoT), with sensors like PH-4502C, DS18B20, PMS5003, YF-S201C, and a tipping bucket rain gauge, the system demonstrates a scalable solution for remote environmental monitoring in smart city, agricultural, and disaster management applications."
    },
    {
        "id": 17,
        "position": "Internet of Things-based Solar Panel Cleaning System Using Automatic Sweeping",
        "company": "Universitas Indonesia",
        "years": "May 2022 - Dec 2022",
        "type": "Project",
        "typebg": 4,
        "start": 22052212,
        "tools": ["BTS7960", "ESP32", "Ultrasonic Sensor", "DC Motor", "Blynk"],
        "filter": [10, 11, "Automation Engineering"],
        "skills": ["Embedded System Engineering", "IoT Engineering", "Automation Engineering"],
        "tasks": "Developed an automated solar panel cleaning system that uses sensor-based logic to determine when cleaning is needed, enhancing panel efficiency and reducing manual maintenance. The system operates along vertical solar arrays, using a DC motor controlled by a BTS7960 driver and an ultrasonic sensor, all managed by an ESP32 microcontroller. Cleaning cycles are scheduled using a programmable timer (via Blynk), allowing the system to remain on standby until the designated interval is reached. Once triggered, the motor activates and moves the cleaning mechanism across the panels, automatically stopping when the end of the array is detected. This solution provides a scalable, low-maintenance approach to keeping solar panels dust-free and operating at optimal performance."
    },    
    {
        "id": 18,
        "position": "Automatic Parts Sorting System Using Schneider PLC Programming Based on Barcode/QR Code and Color with Factory I/O Simulation and Schneider's EcoStruxure Machine Expert Basic",
        "company": "Ruang Elektro",
        "years": "Nov 2023 - Nov 2023",
        "type": "Freelance",
        "typebg": 3,
        "start": 23112311,
        "tools": ["Factory I/O", "Schneider's EcoStruxure Machine Expert Basic"],
        "skills": ["Automation Engineering", "Instrumentation Engineering"],
        "tasks": "Developed an advanced Automatic Parts Sorting System using Schneider's EcoStruxure Machine Expert Basic PLC programming, integrating barcode/QR code scanning and color detection for efficient material sorting. The system leverages latching, timers, and comparison blocks in its PLC logic, and is simulated using Factory I/O with a dual-stage process: initial ID-based sorting followed by color-based sorting via vision sensors. Featuring conveyors, actuators, and intuitive controls, this project showcases precision automation and smart factory simulation for streamlined operations."
    },
    {
        "id": 19,
        "position": "Smart Door Lock System with BLE and REST API for Database Logging",
        "company": "Universitas Indonesia",
        "years": "April 2023 - May 2023",
        "type": "Project",
        "typebg": 4,
        "start": 23042305,
        "tools": ["ESP32", "HTML", "MySQL", "PHP", "CSS", "BLE", "XAMPP"],
        "filter": [10, 11, 12, 13, 5, 6],
        "skills": ["Frontend Engineering", "Backend Engineering", "IoT Engineering", "Embedded System Engineering", "Wireless Engineering"],
        "tasks": "Designed and developed a Smart Door Lock System powered by Bluetooth Low Energy (BLE) and integrated with a REST API for real-time database logging. Built on the ESP32 platform, the system detects user proximity via RSSI, enabling seamless unlocking while securely logging BLE device addresses to a web server through HTTP POST requests. The locking mechanism uses a 12V Solenoid Door Lock controlled by a relay module, which is triggered by the ESP32. The web server features an HTML frontend and a PHP backend, deployed using Apache and MySQL with phpMyAdmin, all managed through XAMPP. This project enhances both convenience and security with remote monitoring and data-driven access control, and includes a performance and power consumption comparison with traditional RFID-based lock systems to demonstrate BLE's efficiency and scalability."
    },
    {
        "id": 20,
        "position": "Arduino-Based Respiration Rate Counter with MPU6050 made with Custom Prototype PCB",
        "company": "Ruang Elektro",
        "years": "Oct 2021 - Nov 2021",
        "type": "Freelance",
        "typebg": 3,
        "start": 21102111,
        "tools": ["Arduino Uno", "Arduino IDE", "16x02 LCD", "MPU6050", "Soldering"],
        "filter": [10],
        "skills": ["Embedded System Engineering"],
        "tasks": "Developed a  a respiration rate monitoring system using Arduino, an MPU6050 sensor, and an LCD display. The MPU6050, combining accelerometer and gyroscope functionality, detects chest movement to monitor breathing. A moving average filter processes the oscillating signal to calculate breaths per minute, which are then displayed in real-time on the LCD. The system was finalized on a custom prototype PCB with all connections soldered for stability and reliability. This project showcases a practical, non-invasive solution for tracking respiratory activity with embedded systems."
    },
    {
        "id": 21,
        "position": "Automatic Baby BMI Calculator",
        "company": "Ruang Elektro",
        "years": "Jan 2023 - Feb 2023",
        "type": "Freelance",
        "typebg": 3,
        "start": 23012302,
        "tools": ["Arduino Uno", "Arduino IDE", "16x02 LCD", "Load Cell Sensor", "Soldering"],
        "filter": [10],
        "skills": ["Embedded System Engineering"],
        "tasks": "One of my client requested a baby scales that can automatically calculate the BMI just by determining the weight and height of a baby. The system use arduino for calculating BMI and LCD for displays For measuring weight, the arduino use 4 load cell that connect to a junction box, and for height, the arduino use laser distance sensor."
    },
    {
        "id": 22,
        "position": "Arduino-based Fire Detector CO2, CO, and O2 sensor",
        "company": "Ruang Elektro",
        "years": "May 2024 - Jul 2024",
        "type": "Freelance",
        "typebg": 3,
        "start": 24052407,
        "tools": ["Arduino Uno", "Arduino IDE", " MQ-9", "DFrobot NDIR CO2 sensor", "electrochemical O2 sensor"],
        "filter": [10],
        "skills": ["Embedded System Engineering"],
        "tasks": "working on an advanced fire detection system using Arduino, integrated with DFrobot NDIR CO2 sensor, electrochemical O2 sensor, and MQ-9 sensor. This setup ensures early and accurate detection of fire hazards by monitoring key gases like CO2, CO, and O2. The system outputs data via serial communication, seamlessly displayed in Microsoft Excel, enhancing safety and response times. Excited about combining hardware and software for real-time monitoring and improved fire safety!"
    },
    {
        "id": 23,
        "position": "IoT based Pulse Oximeter",
        "company": "Ruang Elektro",
        "years": "Jun 2021 - Jul 2021",
        "type": "Freelance",
        "typebg": 3,
        "start": 21062107,
        "tools": ["ESP32", "Arduino IDE", " MAX30102", "Blynk"],
        "filter": [10, 11],
        "skills": ["Embedded System Engineering", "IoT Engineering"],
        "tasks": "An ESP32-based Pulse Oximeter leverages the MAX30102 sensor to accurately measure blood oxygen levels (SpO2) and heart rate. This portable and efficient health monitoring device transmits real-time data to the Blynk application, allowing users to conveniently track their health metrics on their smartphones. This smart device uses the MAX30102 sensor to measure your blood oxygen levels and heart rate, sending real-time data to the Blynk app on your phone. To save energy, it automatically enters deep sleep mode when not in use, making it perfect for continuous monitoring."
    },
    {
        "id": 24,
        "position": "Development of Sign Language Detection System with Faster RCNN and RetinaNet",
        "company": "Ruang Elektro",
        "years": "Apr 2024 - Jun 2024",
        "type": "Freelance",
        "typebg": 3,
        "start": 24042406,
        "tools": ["Faster R-CNN", "RetinaNet", "Roboflow"],
        "filter": [8],
        "skills": ["Computer Vision Engineering"],
        "tasks": "Developed a robust Sign Language Detection System using Faster R-CNN and RetinaNet architectures on Google Colab. The project included building a complete deep learning pipeline—from data preprocessing and annotation to model training and evaluation. Leveraged transfer learning and fine-tuning to enhance detection accuracy, and rigorously assessed model performance using a confusion matrix on a test dataset split. This work contributes toward more accessible and inclusive technology by enabling real-time sign language interpretation through advanced object detection techniques."
    },
    {
        "id": 25,
        "position": "DESIGN AND CONSTRUCTION OF CLASS E WIRELESS POWER AND DATA TRANSFER TRANSMITTER WITH HIGH EFFICIENCY USING A SINGLE COIL AT 10 MHZ FREQUENCY",
        "company": "Universitas Indonesia",
        "years": "Nov 2022 - Jun 2023",
        "type": "Thesis",
        "typebg": 4,
        "start": 22112306,
        "tools": ["PSPICE", "Oscilloscope", "Signal Generator", "Multimeter"],
        "filter": [14, 12],
        "skills": ["Electronics Engineering", "Wireless Engineering"],
        "tasks": "Successfully designed and built a high-efficiency Class E wireless power and data transfer (WPDT) transmitter operating at 10 MHz using a compact single-coil architecture. Unlike conventional WPDT systems that require dual coils and complex circuitry, this innovative design uses a single transmitter coil with amplitude shift keying (ASK) modulation and dual parallel capacitors in series to enable optimal simultaneous power and data transfer. Tested at the PCB level, the system achieved an efficiency of 40.47%, with potential to reach up to 96.44% within an 8.5–11.5 MHz frequency range—making it highly promising for compact biomedical implants that require wireless charging without repeated surgeries."
    }
]